## Como Importar e Organizar seus Dados - Parte III


* Seguem as respostas sugeridas (geralmente, existem várias maneiras de resolver um problema em Python). *


Salve os dados obtidos no exercício anterior como um arquivo csv. Em seguida, salve-o em formato excel. <br />
Você se lembra de qual biblioteca pode ajudá-lo a fazer isso? Não se esqueça de importá-lo primeiro!

In [1]:
import pandas as pd
from pandas_datareader import data as wb

In [4]:
tickers = ['VALE3.SA', 'AMAR3.SA', 'SBSP3.SA', 'PETR4.SA']
dados = pd.DataFrame()
for t in tickers:
    dados[t] = wb.DataReader(t, data_source='yahoo', start='2015-1-1')['Close']

In [9]:
dados.head()

             VALE3.SA  AMAR3.SA   SBSP3.SA  PETR4.SA
Date
2015-01-02  21.280001   13.1909  16.799999      9.36
2015-01-05  20.959999   13.0909  16.799999      8.56
2015-01-06  21.799999   12.2818  16.750000      8.28
2015-01-07  22.600000   12.5091  17.100000      8.67
2015-01-08  22.840000   12.3727  17.160000      9.23

In [8]:
dados.tail()

             VALE3.SA  AMAR3.SA   SBSP3.SA   PETR4.SA
Date
2020-09-01  61.759998      8.54  49.349998  22.870001
2020-09-02  61.320000      8.74  50.299999  22.799999
2020-09-03  59.320000      8.55  48.990002  22.879999
2020-09-04  60.490002      8.43  49.160000  22.920000
2020-09-08  59.270000      8.21  49.189999  22.230000

In [10]:
dados.to_csv('C:/Users/leona/OneDrive/Área de Trabalho/exercicios/exemplo1.csv')

In [11]:
dados.to_excel('C:/Users/leona/OneDrive/Área de Trabalho/exercicios/exemplo2.xlsx')